public class Earth implements Planets {
    private static Earth INSTANCE; //створюємо приватну статичну посилальну змінну Singleton - ШАБЛОН

    private Earth() {} //створюємо приватний конструктор цього класу, який не дозволяє створювати нові об'єкти
    // поза межами цього класу (так реалізуємо можливість бути класу Singleton)

    public static Earth getInstance() { //публічний статичний метод, який повертає екземпляр класу, цей метод називається
        // getInstance - отримати екземпляр. Це глобальна точка доступу до екземпляра класу. Метод дозволяє виконати ліниву
        // ініціалізацію
        if (INSTANCE == null) { //якщо екземпляр не створений (не ініціалізований), то
            synchronized (Earth.class) { //виконуємо синхронізацію для потокобезпеки (при багатопоточності)
                if (INSTANCE == null) { //ще раз перевіряємо, що екземпляр не створений (не ініціалізований)
                    INSTANCE = new Earth(); //ініціалізуємо його
                }
            }
        }
        return INSTANCE; //повертаємо ініціалізований екземпляр
    }
}
