public class Jupiter implements Planets {
    private static Jupiter INSTANCE; // створюємо приватну статичну змінну-ссилку для Синглетону - ШАБЛОН

    private Jupiter() {} // створюємо приватний конструктор цього класу, який не дозволяє створювати нові об'єкти
    // за межами цього класу (реалізує можливість бути класу Синглетоном)

    public static Jupiter getInstance() { // публічний статичний метод, який повертає екземпляр класу, цей метод називається
        // getInstance - отримати екземпляр. Це глобальна точка доступу до екземпляра класу. Метод дозволяє виконати лінійне
        // завантаження
        if (INSTANCE == null) { // якщо ШАБЛОН не створений (не ініціалізований), то
            synchronized (Jupiter.class) { // виконуємо синхронізацію для потокобезпечності (при багатопоточності)
                if (INSTANCE == null) { // ще раз перевіряємо, що ШАБЛОН не створений (не ініціалізований)
                    INSTANCE = new Jupiter(); // ініціалізуємо його
                }
            }
        }
        return INSTANCE; // повертаємо проініціалізований ШАБЛОН
    }
}
