public class Mercury implements Planets {
    private static Mercury INSTANCE; // створюємо приватну статичну змінну посилання на Синглетон - ОБРАЗЕЦ

    private Mercury() {} // створюємо приватний конструктор цього класу, який не дозволяє створювати нові об'єкти
    // за межами цього класу (реалізує можливість бути класу Синглетоном)

    public static Mercury getInstance() { // публічний статичний метод, який повертає екземпляр класу, цей метод називають
        // getInstance - отримати екземпляр. Це глобальна точка доступу до екземпляру класу. Метод дозволяє виконати ледачу
        // ініціалізацію
        if (INSTANCE == null) { // якщо ОБРАЗЕЦ ще не створений (не ініціалізований), то
            synchronized (Mercury.class) { // виконуємо синхронізацію для безпеки в умовах багатопоточності
                if (INSTANCE == null) { // ще раз перевіряємо, що ОБРАЗЕЦ не створений (не ініціалізований)
                    INSTANCE = new Mercury(); // ініціалізуємо його
                }
            }
        }
        return INSTANCE; // повертаємо проініціалізований ОБРАЗЕЦ
    }
}
