public interface Planets { //публичный интерфейс планеты (как пример, чтоб показать, что в Интерфейсе можно создавать переменные-константы)
    static final String SUN = "sun"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Солнце
    static final String MOON = "moon"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Месяц
    static final String EARTH = "earth"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Земля
    static final String MERCURY = "mercury"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Меркурий
    static final String VENUS = "venus"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Венера
    static final String MARS = "mars"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Марс
    static final String JUPITER = "jupiter"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Юпитер
    static final String SATURN = "saturn"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Сатурн
    static final String URANUS = "uranus"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Уран
    static final String NEPTUNE = "neptune"; //статическая финальная(по-умолчанию) проинициализированная строковая переменная Нептун
}
