public interface Planets { // публічний інтерфейс для планет (як приклад, щоб показати, що в інтерфейсі можна створювати змінні-константи)
    static final String SUN = "sun"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Сонце
    static final String MOON = "moon"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Місяць
    static final String EARTH = "earth"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Земля
    static final String MERCURY = "mercury"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Меркурій
    static final String VENUS = "venus"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Венера
    static final String MARS = "mars"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Марс
    static final String JUPITER = "jupiter"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Юпітер
    static final String SATURN = "saturn"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Сатурн
    static final String URANUS = "uranus"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Уран
    static final String NEPTUNE = "neptune"; // статична фінальна (за замовчуванням) ініціалізована строкова змінна Нептун
}
