public class Saturn implements Planets {
    private static Saturn INSTANCE; // створюємо приватну статичну змінну посилання Singleton - ОБРАЗЕЦ

    private Saturn() {} // створюємо приватний конструктор цього класу, який не дає можливості створювати нові об'єкти
    // за межами цього класу (так би мовити, реалізує можливість бути класу Singleton)

    public static Saturn getInstance() { // публічний статичний метод, який повертає екземпляр класу, цей метод називають
        // getInstance - отримати екземпляр. Це глобальна точка доступу до екземпляру класу. Метод дозволяє виконати лінивий
        // завантаження
        if (INSTANCE == null) { // якщо ОБРАЗЕЦ не створений (не ініціалізований), то
            synchronized (Saturn.class) { // виконуємо синхронізацію для потокобезпечності (при багатопоточності)
                if (INSTANCE == null) { // ще раз перевіряємо, що ОБРАЗЕЦ не створений (не ініціалізований)
                    INSTANCE = new Saturn(); // ініціалізуємо його
                }
            }
        }
        return INSTANCE; // повертаємо проініціалізований ОБРАЗЕЦ
    }
}

