public class Uranus implements Planets {
    private static Uranus INSTANCE; // створюємо приватну статичну змінну-силку для Синглетону - ОБРАЗЕЦ

    private Uranus() {} // створюємо приватний конструктор цього класу, який не дозволяє створювати нові об'єкти
    // за межами цього класу (так реалізується можливість бути класу Синглетоном)

    public static Uranus getInstance() { // публічний статичний метод, який повертає екземпляр класу, цей метод називають
        // getInstance - отримати екземпляр. Це глобальна точка доступу до екземпляра класу. Метод дозволяє виконати ледачу
        // завантаження
        if (INSTANCE == null) { // якщо ОБРАЗЕЦ не створений (не ініціалізований), то
            synchronized (Uranus.class) { // виконуємо синхронізацію для потокобезпеки (при багатопоточності)
                if (INSTANCE == null) { // ще раз перевіряємо, що ОБРАЗЕЦ не створений (не ініціалізований)
                    INSTANCE = new Uranus(); // ініціалізуємо його
                }
            }
        }
        return INSTANCE; // повертаємо ініціалізований ОБРАЗЕЦ
    }
}
