public class Venus implements Planets {
    private static Venus INSTANCE; // створюємо приватну статичну змінну для синглетона - ОБРАЗЕЦ

    private Venus() {} // створюємо приватний конструктор цього класу, який не дозволяє створювати нові об'єкти
    // за межами цього класу (реалізує можливість бути класу синглетоном)

    public static Venus getInstance() { // публічний статичний метод, який повертає екземпляр класу, цей метод називається
        // getInstance - отримати екземпляр. Це глобальна точка доступу до екземпляра класу. Метод дозволяє виконати ледаче
        // завантаження
        if (INSTANCE == null) { // якщо ОБРАЗЕЦ не створений (не ініціалізований), то
            synchronized (Venus.class) { // виконуємо синхронізацію для потокобезпечності (при багатопоточності)
                if (INSTANCE == null) { // ще раз перевіряємо, що ОБРАЗЕЦ не створений (не ініціалізований)
                    INSTANCE = new Venus(); // ініціалізуємо його
                }
            }
        }
        return INSTANCE; // повертаємо ініціалізований ОБРАЗЕЦ
    }
}
